export const infrastructureDataCsv = `类型,机构名称,机构地址,联系方式,服务内容
认证机构,方圆标志认证集团湖南有限公司,长沙市天心区南湖路458号蓝湾国际A座907-912,张露 13975198612,管理体系认证、产品认证、服务认证、管理体系培训、质量技术与方法培训等
计量服务机构,株洲市计量测试检定所,株洲市天元区黄河北路788号,28689552,负责株洲市范围内的强制检定、质量监督检验、公正计量测试和计量仲裁检定，依法依规对计量器具进行周期检定
计量服务机构,国网株洲供电公司,荷塘区文化路812号,舒灿，13574270000,电能表检定、校验。
计量服务机构,株洲市水表计量检定授权站,株洲市石峰区建设北路98号,刘仁错，18973353354,冷水水表检定、涡轮流量计检定、超声流量计检定、电磁流量计检定。
检验检测机构,湖南大京科技有限公司,株洲市芦淞区航陌路航安科创园2.2期1-3栋,柳文婷 15973336069,检验检测;计量服务;认证认可;质量诊断;标准化服务
检验检测机构,湖南省特种设备检验检测研究院株洲分院,株洲市荷塘区新华西路育才路55号,0731-28687848,负责电梯、起重机械、场（厂）内机动车辆、锅炉、压力容器及压力管道特种设备检验检测工作。
检验检测机构,湖南机动车检测技术有限公司（国家新能源汽车质量检验检测中心）,株洲市天元区上检路6号,0731-28668031,机动车安全技术检验服务、机动车性能检验服务。
检验检测机构,株洲国创轨道科技有限公司,株洲市石峰区轨道交通双创园B2南栋10楼,张昌福 18273389693,软件技术服务;新材料技术推广服务;机械技术推广服务;科技信息咨询;科技成果鉴定;科技企业技术扶持;高
检验检测机构,株洲硬质合金集团有限公司分析测试服务中心,湖南省株洲市钻石路288号,李惠芳 0731-8260907 13873348353 13973315985,化学元素分析;粒度分析;密度测试;流动性测试;硬度测试;金相分析;强度测试;物相分析;电子显微镜分析
检验检测机构,湖南滨华电力电瓷电器检测检验有限公司,湖南省醴陵市经济开发区东富工业园东富大道3号,骆彩 15073110401 0731-22102526,电瓷产品检测;高压电气产品检测;工业自动化装备技术服务;标准制定;认证检测;设备研发;技术咨询
检验检测机构,国家轻工业陶瓷质量监督检测醴陵站,湖南省株洲醴陵市寨子岭315号湖南省陶瓷研究所3号楼,袁莉 0731-23233070 13974178883,日用陶瓷检测;建筑陶瓷检测;工业陶瓷检测;耐火材料检测;无机非金属材料检测
检验检测机构,湖南时空信息安全检测服务有限公司,湖南省株洲市石峰区云田镇菖塘路88号云龙创业创新园12号栋1层厂房,云天林 18566202766,北斗芯片模块终端检测;定位精度检测;测速精度检测;重捕获时间检测;灵敏度检测
检验检测机构,攸县远通机动车检测有限公司,湖南省株洲市攸县上云桥高岸村大塘组,涂家宽 18673313988,机动车安全技术检验;机动车环保检验;机动车综合性能检验
检验检测机构,株洲市醴陵生态环境监测站,湖南省株洲市醴陵市财源路116号,周雅倩 18874105109,生态环境监测
检验检测机构,炎陵县华辉机动车检测有限公司,湖南省株洲市炎陵县霞阳镇五星排村黄土坳组,李陈辉 15873371666,机动车安全技术性能检测;机动车排气污染物检测
检验检测机构,株洲百通机动车安全性能检测有限公司,湖南省株洲市天元区珠江南路东侧株洲百通网络科技有限公司厂房,何丽 18670878222,机动车检验检测服务
检验检测机构,湖南省地质工程勘察院有限公司,湖南省株洲市荷塘区水文路168号,徐驰 15273286301,环境检测;矿产品检测;工程材料检测;勘察样品检测;地球化学样品检测
检验检测机构,鸿丰机动车检测有限责任公司,湖南省株洲市渌口区渌口镇南江北路29号,宾金明 18973300977,小型汽车安全性能检测;汽车排气污染物检测;摩托车安全性能检测
检验检测机构,湖南省恒吉机动车检测有限公司,湖南省株洲市天元区汽车博览园广汽路89号,谭小庆 13873385555,小型汽油车定检;新车注册检测
检验检测机构,株洲市广通机动车安全性能检测有限公司,湖南省株洲市石峰区建设北路86号响石花园2栋204房,张鑫华 13317414056,C1 C2 C3车型机动车安全技术检测及排气污染检测
检验检测机构,湖南玖泰机动车检测有限公司,湖南省株洲市芦淞区贺家土街道人民中路79号株洲市一汽运有限责任公司场地,沈品超 18020355355,C1 C2 C3蓝牌小型汽车及3.5吨以下货车环保与安全检测
检验检测机构,攸县宝悦机动车检测有限公司,湖南省株洲市攸县谭桥街道谭桥社区湘东汽贸城内宝悦检测站,彭辉 18907414819,机动车安全性能检测;机动车环保检测;摩托车检测
检验检测机构,醴陵市鑫昊机动车检测有限公司,湖南省株洲市醴陵市李畋镇凤形村四方塘组,李先平 18974165666,机动车检测;机动车排气污染检测
检验检测机构,攸县华湘机动车安全性能检测有限公司,湖南省株洲市攸县网岭镇宏大村,罗湘荣 13907417812,环保检测;安检;综检;汽车喷字
检验检测机构,醴陵市顺达机动车检测有限公司,湖南省株洲市醴陵市孙家湾镇龙尾湾村,李志华 18932137323,机动车安全性能检测;机动车环保性能检测;机动车综合性能检测
检验检测机构,攸县通顺机动车检测有限公司,湖南省株洲市攸县联星街道高岭社区新和组,易俊强 18673364719,机动车安全性能检测;机动车环保检测
检验检测机构,湖南泰华科技检测有限公司,湖南省株洲市天元区栗雨工业园高新一街A07,李洲 13617332926,水和废水检测;环境空气检测;土壤检测;水系沉积物检测;噪声检测;固体废物检测
检验检测机构,株洲市丰祥机动车检测有限公司,湖南省株洲市天元区科瑞路9号株洲通达铁路电机厂厂房101号,贺志容 13135339967,机动车检验检测服务
检验检测机构,湖南三通机动车服务有限公司,湖南省株洲市荷塘区明照乡桂花路黄泥塘,凌信军 139675331627,机动车检测服务
检验检测机构,株洲元盛机动车检测有限公司,湖南省株洲市石峰区天桥街249号,何中明 13762269393,机动车检测服务
检验检测机构,醴陵市常庆机动车检测有限公司,湖南省株洲市醴陵市来龙门街道黄沙村101号,谭和平 18973386333,机动车安全检测;机动车综合性能检测;机动车排气污染检测
检验检测机构,株洲市中心医院司法鉴定中心,湖南省株洲市天元区长江南路116号门诊四楼,0731-28561147,法医临床鉴定;法医病理鉴定;法医物证鉴定;法医毒物鉴定
检验检测机构,湖南铁科检测技术有限公司,湖南省株洲市石峰区井龙街道联诚路66号8号厂房,吴翔成 15673303183,通风机气动性能试验;热交换器散热性能试验;电机性能试验;电气产品环境试验;电磁兼容试验
检验检测机构,株洲天源机动车检测服务有限公司,湖南省株洲市天元区黑龙江路599号,汪磊 18073321133,小型汽油车定检
检验检测机构,湖南五度检测有限公司,湖南省株洲市攸县江桥街道湖公庙社区商业路A栋5楼,周可立 13786375678,水质检测;大气检测;噪声检测;室内甲醛检测
检验检测机构,株洲市四通机动车安全技术综合检测有限公司,湖南省株洲市荷塘区红旗中路37号,袁春海 18908436789,机动车安全检测;综合性能检测;排气污染检测
检验检测机构,湖南云天检测技术有限公司,株洲市石峰区云海大道289号检测中心,袁琳 15173352529,水质检测;土壤检测;固体废物检测;食品检测;司法鉴定
检验检测机构,湖南宁正科技有限公司,湖南省株洲市天元区马家河街道金马路1号中南高科株洲智创广场10号厂房4楼,王兆玉 18073377176,农药残留检测;兽药残留检测;重金属检测;食品添加剂检测;营养成分检测
检验检测机构,湖南日新计量检测有限公司,湖南省株洲市天元区天易大道959号高科新马金谷B6栋203 303室,赵志友 18107334853,振动冲击试验;盐雾试验;防护等级试验;温湿度试验;风机性能试验
检验检测机构,株洲鑫达机动车检测有限公司,湖南省株洲市天元区株洲大道618号一汽丰田4S店101号,罗伟 13786123088;龙家乐15348335837,非营运小型微型载客汽车安全环保检测
检验检测机构,醴陵市万合机动车检测有限公司,湖南省株洲市醴陵市仙岳山街道江源村十里亭35号,郭晴 1561633699,机动车检测;安全技术检测;环保检测
检验检测机构,攸县食品药品和质量技术检验检测中心,湖南省株洲攸县联星街道攸衡北路3号,肖新迎 0731-24251695,食品检测;中药饮片检测;保健品检测;工业产品检测;计量检定
检验检测机构,株洲市云峰机动车安全技术检测公司,湖南省株洲市石峰区湘珠路,刘智凌 157733307333,机动车安全技术检测;排气污染检测;综合性能检测
检验检测机构,湖南西正司法鉴定服务有限公司,湖南省株洲市天元区马家河街道新马南路266号新马金谷三期C1栋10层,刘丹凤 18673362602,司法鉴定服务;资产评估;检验检测服务
检验检测机构,株洲车友机动车辆检测有限公司,湖南省株洲市天元区嵩山路街道黄河北路1291号栗雨高科园付料库101-A区,刘定兰 15773346576;肖君13507333365,机动车安全性能检测;机动车环保排放检测
检验检测机构,醴陵市振兴车辆检测服务有限公司,湖南省株洲市醴陵市左权路128号,丁志芳 15673394199,机动车检测服务
检验检测机构,中国化工株洲橡胶研究设计院有限公司（国家乳胶制品质量检验检测中心）,湖南省株洲市荷塘区新华东路818号,高静 15073187369,乳胶制品检测;橡胶制品检测;油漆涂料检测
`;

export function parseCsv(csv: string) {
  const lines = csv.trim().split('\n');
  const headers = lines[0].split(',');
  return lines.slice(1).map(line => {
    const values = line.split(',');
    return headers.reduce((obj, header, index) => {
      obj[header.trim()] = values[index]?.trim() || '';
      return obj;
    }, {} as Record<string, string>);
  });
}
